tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-7;

boundaryField
{
    walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wallFilm
    {
        type            nutkFilmWallFunction;
        B               5.5;
        yPlusCrit       11.05;
        value           uniform 0;
    }
}


// ************************************************************************* //
